# Adjusting Revenue for Inflation #

In [1]:
import numpy as np
import pandas as pd
import json

import statsmodels.api as sm

import matplotlib.pyplot as plt 
%matplotlib inline

import random as rand
import seaborn as sns

from sklearn.metrics import mean_squared_error
#from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

from datetime import datetime

In [2]:
movies = pd.read_csv("cleaned_data.csv")

In [3]:
#movies["revenue"]

In [44]:
#Getting release dates
release_dates = movies.iloc[:,[0,14]]
release_dates
#type(release_dates)

          id release_date
0      10003   1997-04-03
1     100042   2014-11-12
2      10012   2005-02-25
3      10013   1986-10-05
4      10014   1985-10-31
...      ...          ...
4508    9986   2006-12-15
4509   99861   2015-04-22
4510    9988   2006-08-25
4511    9989   2001-01-12
4512    9994   1986-07-02

[4513 rows x 2 columns]

In [5]:
#Only Getting Data w/o NaN
release_dates_filt = release_dates[release_dates['release_date'].notnull()]

In [6]:
#Only Getting Data w/o NaN
#release_dates_f = release_dates[release_dates['release_date'].notnull()]

In [7]:
#Trying an example first
release_date_ex = release_dates_filt.iloc[0][1]
#print(release_date_ex)
#type(release_date_ex)

#Str to date format
#https://www.digitalocean.com/community/tutorials/python-string-to-datetime-strptime
datetime.strptime(release_date_ex, '%Y-%m-%d').date()

datetime.date(1997, 4, 3)

In [8]:
#Replace NaN data with 0
#release_dates.replace('nan','0000-00-00')
#release_dates.fillna('0000-00-00')

In [9]:
#Release dates transformed into DateTime format in a Pandas Dataset:

dates = []

for i in range(len(release_dates_filt)):
    #print(type(release_dates.iloc[i][1]))
    entry_date = datetime.strptime(release_dates_filt.iloc[i][1], '%Y-%m-%d').date()
    dates.append([release_dates_filt.iloc[i][0],entry_date])

dates = pd.DataFrame(dates)

In [10]:
print(type(dates.iloc[0][1]))
dates

<class 'datetime.date'>

           0           1
0      10003  1997-04-03
1     100042  2014-11-12
2      10012  2005-02-25
3      10013  1986-10-05
4      10014  1985-10-31
...      ...         ...
4508    9986  2006-12-15
4509   99861  2015-04-22
4510    9988  2006-08-25
4511    9989  2001-01-12
4512    9994  1986-07-02

[4513 rows x 2 columns]

In [11]:
years = []
for i in range(len(release_dates_filt)):
    entry_year = dates.iloc[i][1].year
    years.append([release_dates_filt.iloc[i][0],entry_year])
years

[[10003, 1997],
 [100042, 2014],
 [10012, 2005],
 [10013, 1986],
 [10014, 1985],
 [10015, 1986],
 [10016, 2001],
 [10017, 1986],
 [10019, 1987],
 [10020, 1991],
 [10021, 1987],
 [10022, 2005],
 [10023, 1987],
 [10024, 2009],
 [100241, 2014],
 [10025, 2006],
 [10027, 2005],
 [10028, 2003],
 [10029, 1998],
 [10030, 2007],
 [100402, 2014],
 [10048, 2005],
 [10052, 2002],
 [10053, 2006],
 [10054, 2001],
 [10057, 1993],
 [10060, 2005],
 [10061, 1996],
 [10065, 2005],
 [10066, 2005],
 [10067, 2006],
 [10068, 1986],
 [10069, 2006],
 [10072, 1987],
 [10073, 2006],
 [10077, 2005],
 [100791, 2012],
 [10083, 1987],
 [10090, 2007],
 [10092, 2005],
 [10093, 2006],
 [10096, 2004],
 [10098, 1921],
 [101, 1994],
 [10110, 1987],
 [10112, 1970],
 [10117, 1988],
 [101173, 2011],
 [10126, 1988],
 [101267, 2012],
 [10127, 1988],
 [10128, 1988],
 [101299, 2013],
 [10131, 1988],
 [10132, 1988],
 [10134, 1989],
 [10135, 1989],
 [10136, 1986],
 [10137, 1999],
 [10138, 2010],
 [10139, 2008],
 [10140, 2010],
 [10142, 1989],
 [10144, 1989],
 [10145, 2004],
 [10147, 2003],
 [10149, 1995],
 [101501, 2011],
 [10152, 2003],
 [10153, 1998],
 [10155, 1997],
 [10156, 1981],
 [10159, 2003],
 [10160, 1989],
 [10163, 1992],
 [10173, 1990],
 [10174, 1991],
 [10178, 1954],
 [1018, 2001],
 [10184, 2009],
 [10185, 2008],
 [10186, 2008],
 [10187, 2008],
 [10188, 2008],
 [10189, 2008],
 [10191, 2010],
 [10192, 2010],
 [10193, 2010],
 [10195, 2011],
 [10196, 2010],
 [10197, 2009],
 [10198, 2009],
 [10199, 2008],
 [10200, 2008],
 [10201, 2008],
 [10202, 2008],
 [10204, 2004],
 [10206, 1992],
 [10207, 1999],
 [10208, 1999],
 [10215, 1998],
 [10216, 1998],
 [10218, 1996],
 [102197, 2012],
 [10220, 1998],
 [10222, 1989],
 [10225, 1986],
 [10228, 1998],
 [10229, 2002],
 [102382, 2014],
 [10246, 1981],
 [10249, 1991],
 [10263, 2005],
 [102651, 2014],
 [10269, 1983],
 [10276, 1991],
 [102780, 2012],
 [10281, 1988],
 [10283, 1989],
 [10285, 1993],
 [102899, 2015],
 [10294, 2007],
 [103, 1976],
 [10303, 1985],
 [10306, 1988],
 [10307, 1999],
 [10312, 1998],
 [10313, 2009],
 [10314, 1999],
 [10315, 2009],
 [10316, 2011],
 [10317, 2015],
 [10320, 2005],
 [10323, 1981],
 [10327, 2003],
 [10329, 1995],
 [10330, 2003],
 [10331, 1968],
 [10333, 1991],
 [10336, 1997],
 [10337, 1991],
 [10339, 1956],
 [10342, 1999],
 [10345, 1989],
 [10349, 1993],
 [10351, 1997],
 [10358, 2008],
 [10362, 2008],
 [103620, 2012],
 [10364, 1970],
 [10366, 1999],
 [103686, 2012],
 [10371, 1997],
 [103731, 2013],
 [10375, 2002],
 [10377, 1992],
 [10379, 1991],
 [10384, 2000],
 [10385, 2000],
 [10386, 1999],
 [10388, 1999],
 [10397, 1999],
 [10398, 1999],
 [10400, 1999],
 [10402, 1999],
 [10403, 1992],
 [10409, 1992],
 [10414, 1992],
 [10423, 1993],
 [10424, 1992],
 [10425, 2007],
 [10426, 2002],
 [10427, 1993],
 [10428, 1995],
 [10431, 2007],
 [10436, 1993],
 [10438, 1993],
 [10439, 1993],
 [10440, 1993],
 [10442, 1993],
 [10447, 1994],
 [10448, 1994],
 [10461, 2000],
 [10466, 1986],
 [10471, 2000],
 [104755, 2012],
 [10476, 2005],
 [10477, 2001],
 [10478, 1996],
 [10479, 2000],
 [10481, 2000],
 [10483, 2008],
 [10488, 2008],
 [10489, 1983],
 [10490, 1999],
 [10493, 1989],
 [10497, 1992],
 [105, 1985],
 [10501, 2000],
 [1051, 1971],
 [10514, 1971],
 [10518, 1976],
 [10520, 2007],
 [10521, 2009],
 [10523, 2008],
 [105254, 1971],
 [10527, 2008],
 [10528, 2009],
 [10529, 2008],
 [10530, 1995],
 [10533, 1995],
 [10534, 1996],
 [10537, 1991],
 [10538, 1992],
 [10539, 1996],
 [10545, 1996],
 [10546, 1996],
 [10547, 1996],
 [10550, 2002],
 [10555, 2004],
 [10559, 2000],
 [10560, 2000],
 [10562, 2000],
 [10564, 2000],
 [10567, 2000],
 [10571, 2000],
 [10576, 1983],
 [10577, 2000],
 [10585, 1988],
 [10586, 1996],
 [105864, 2015],
 [10589, 2004],
 [10590, 2002],
 [10591, 2004],
 [10592, 2002],
 [10599, 2002],
 [106, 1987],
 [10601, 2003],
 [10611, 2002],
 [106135, 2012],
 [10622, 1997],
 [10623, 2003],
 [10625, 2004],
 [10627, 1981],
 [10629, 2003],
 [10632, 2003],
 [10633, 1967],
 [10634, 1995],
 [10637, 2000],
 [10644, 1988],
 [10646, 2001],
 [10647, 2000],
 [10649, 1976],
 [10650, 1983],
 [10658, 1986],
 [10661, 2008],
 [10663, 1998],
 [106646, 2013],
 [10665, 2008],
 [10669, 1972],
 [10671, 1970],
 [10673, 1987],
 [10674, 1998],
 [106747, 2013],
 [10675, 1988],
 [10676, 1982],
 [10677, 2004],
 [10678, 2003],
 [10679, 2012],
 [10681, 2008],
 [10683, 1998],
 [10684, 1996],
 [10688, 2000],
 [10690, 1996],
 [10691, 2001],
 [10693, 1953],
 [10694, 1994],
 [10696, 2001],
 [107, 2000],
 [10707, 2005],
 [10708, 2003],
 [10712, 2002],
 [10715, 2003],
 [10718, 2004],
 [10719, 2003],
 [10720, 2003],
 [10723, 1996],
 [10724, 1982],
 [10725, 1981],
 [10730, 1976],
 [10731, 1994],
 [10733, 2004],
 [10734, 1979],
 [10747, 1976],
 [10756, 2003],
 [10758, 2007],
 [10760, 2007],
 [10761, 2008],
 [10762, 2004],
 [10764, 2008],
 [10766, 1978],
 [10774, 1976],
 [10776, 1986],
 [10779, 1996],
 [10780, 1987],
 [107811, 2013],
 [10782, 2003],
 [107846, 2013],
 [10796, 2001],
 [10802, 1995],
 [10803, 1976],
 [10805, 1983],
 [10808, 2001],
 [10823, 1984],
 [10830, 1996],
 [108312, 1986],
 [108346, 1999],
 [10843, 1985],
 [10849, 1985],
 [10858, 1995],
 [10861, 1996],
 [10862, 2000],
 [10865, 2001],
 [10866, 2001],
 [10871, 1997],
 [10872, 1994],
 [10873, 2000],
 [10876, 2000],
 [10877, 2001],
 [10878, 2001],
 [10879, 1994],
 [10882, 1959],
 [1089, 1991],
 [10890, 1981],
 [108923, 1928],
 [10894, 2002],
 [10895, 1940],
 [1090, 1999],
 [10900, 2008],
 [10906, 1992],
 [10907, 1938],
 [10909, 1993],
 [109091, 2013],
 [1091, 1982],
 [10911, 1961],
 [10923, 2003],
 [10925, 1985],
 [10934, 2003],
 [10935, 1980],
 [10937, 1987],
 [109410, 2013],
 [109414, 2013],
 [109417, 2013],
 [109418, 2013],
 [109421, 2013],
 [109424, 2013],
 [109428, 2013],
 [109431, 2013],
 [109439, 2013],
 [10944, 2003],
 [109443, 2013],
 [109445, 2013],
 [109451, 2013],
 [10946, 2007],
 [10948, 1981],
 [109491, 2013],
 [10950, 2001],
 [109513, 2012],
 [10952, 1991],
 [10956, 2001],
 [10957, 1985],
 [10972, 2001],
 [109729, 2013],
 [10982, 2005],
 [10987, 1995],
 [10992, 2001],
 [10996, 2002],
 [10998, 1987],
 [10999, 1985],
 [11, 1977],
 [11000, 1996],
 [11001, 1999],
 [11003, 1998],
 [11007, 2003],
 [11009, 1977],
 [11013, 2002],
 [11015, 1997],
 [11017, 1995],
 [11018, 1985],
 [11022, 2002],
 [11023, 2003],
 [11026, 2004],
 [1103, 1981],
 [11031, 1984],
 [11033, 1980],
 [11034, 1974],
 [11036, 2004],
 [11040, 1970],
 [110402, 2013],
 [110415, 2013],
 [11045, 2004],
 [11046, 1968],
 [11051, 1988],
 [11052, 2004],
 [11058, 2004],
 [11059, 2003],
 [11064, 1985],
 [11066, 1992],
 [110669, 1950],
 [11072, 1974],
 [11081, 2004],
 [11085, 1962],
 [11086, 2001],
 [11087, 1992],
 [11090, 2001],
 [11091, 2001],
 [11092, 1990],
 [11093, 2003],
 [11096, 2005],
 [111, 1983],
 [11113, 1964],
 [111190, 2013],
 [11123, 1974],
 [111237, 2012],
 [11128, 2004],
 [11130, 2004],
 [11132, 2004],
 [11133, 1986],
 [11135, 1990],
 [111479, 2013],
 [11153, 1983],
 [11158, 1992],
 [11165, 1970],
 [11169, 2004],
 [11170, 2006],
 [11172, 2007],
 [11185, 1989],
 [11186, 1990],
 [11187, 1991],
 [11202, 1970],
 [11206, 1967],
 [11208, 2004],
 [11209, 1960],
 [11212, 1994],
 [11217, 2004],
 [11219, 1955],
 [112205, 2013],
 [11221, 1984],
 [11224, 1950],
 [11228, 1996],
 [112284, 1936],
 [11231, 1994],
 [11237, 2004],
 [1124, 2006],
 [11247, 2004],
 [11249, 2004],
 [1125, 2006],
 [11252, 1998],
 [11253, 2008],
 [11258, 1998],
 [11259, 1992],
 [11260, 2008],
 [11281, 1981],
 [11282, 2004],
 [11283, 2005],
 [11284, 1991],
 [11285, 1988],
 [11286, 1981],
 [11287, 1992],
 [112949, 2013],
 [11296, 1984],
 [11298, 1981],
 [11302, 1971],
 [11306, 1996],
 [11307, 1982],
 [11309, 1990],
 [11313, 2001],
 [11319, 1977],
 [11321, 2008],
 [11322, 2009],
 [11323, 2009],
 [11324, 2010],
 [11327, 1978],
 [11329, 2003],
 [11336, 1983],
 [11337, 1980],
 [11338, 1985],
 [11351, 2003],
 [11352, 1989],
 [11355, 1999],
 [11357, 1988],
 [11358, 2004],
 [11360, 1941],
 [11361, 1989],
 [11362, 2002],
 [11363, 1996],
 [11370, 2001],
 [11371, 2001],
 [11375, 2003],
 [11377, 1999],
 [11380, 2001],
 [11393, 1984],
 [113947, 2012],
 [11395, 1994],
 [11397, 2001],
 [11398, 2000],
 [114, 1990],
 [11400, 2005],
 [11411, 1987],
 [11412, 1996],
 [114150, 2012],
 [11419, 1997],
 [11426, 1953],
 [11431, 2005],
 [11439, 2010],
 [11442, 2002],
 [11448, 1995],
 [11451, 2005],
 [11452, 2002],
 [11453, 2005],
 [11454, 1986],
 [11456, 2001],
 [114574, 2012],
 [11459, 2005],
 [11460, 2005],
 [11462, 1941],
 [11468, 2002],
 [11470, 2001],
 [11474, 1979],
 [11478, 2000],
 [11495, 1984],
 [11497, 1989],
 [115, 1998],
 [11503, 1988],
 [11507, 1984],
 [11515, 2006],
 [11517, 1995],
 [11519, 1979],
 [11527, 1981],
 [11529, 2002],
 [115348, 2013],
 [11536, 1961],
 [11541, 1982],
 [11542, 1980],
 [11543, 1996],
 [11544, 2002],
 [11545, 1998],
 [11547, 2003],
 [11551, 1998],
 [11558, 1976],
 [11560, 2002],
 [11561, 1973],
 [11562, 1989],
 [11565, 2006],
 [11568, 1998],
 [11569, 1992],
 [11575, 1965],
 [11576, 1963],
 [11577, 1973],
 [115782, 2013],
 [11586, 1977],
 [11589, 1970],
 [11592, 1994],
 [11595, 1990],
 [11596, 1994],
 [116, 2005],
 [11600, 2007],
 [11601, 1999],
 [11615, 2003],
 [11618, 1999],
 [11619, 2006],
 [1162, 1962],
 [11620, 1951],
 [11622, 1999],
 [11624, 1972],
 [11631, 2008],
 [11632, 2004],
 [11635, 2003],
 [11637, 2005],
 [11638, 2005],
 [11639, 1982],
 [1164, 2006],
 [11644, 1981],
 [11646, 1981],
 [11648, 2005],
 [11649, 1987],
 [1165, 2006],
 [11661, 2005],
 [11665, 2008],
 [11667, 1994],
 [11671, 2008],
 [116711, 2013],
 [11674, 1996],
 [116741, 2013],
 [116745, 2013],
 [11675, 1998],
 [11678, 2000],
 [11679, 2005],
 [11683, 2005],
 [11686, 1975],
 [11688, 2000],
 [11690, 1988],
 [11692, 2002],
 [11697, 1962],
 [116977, 2012],
 [11699, 2009],
 [117, 1987],
 [11702, 1998],
 [11704, 1982],
 [11706, 1956],
 [117251, 2013],
 [117263, 2013],
 [117553, 1993],
 [11774, 2004],
 [11775, 2003],
 [11778, 1978],
 [11780, 1995],
 [11797, 1985],
 [118, 2005],
 [11802, 2008],
 [11804, 2005],
 [11808, 1998],
 [11811, 1993],
 [11812, 2002],
 [11815, 1958],
 [11831, 1997],
 [118340, 2014],
 [11835, 2007],
 [11836, 2004],
 [118452, 1998],
 [11849, 2000],
 [11850, 1978],
 [11858, 1994],
 [11859, 1995],
 [11861, 1995],
 [11863, 1995],
 [11864, 1985],
 [11866, 2004],
 [11870, 2002],
 [11873, 1986],
 [11884, 1984],
 [11886, 1973],
 [11890, 1991],
 [11892, 2002],
 [11893, 1985],
 [11896, 1987],
 [11897, 1962],
 [11901, 1973],
 [11917, 2008],
 [11918, 2008],
 [11928, 2009],
 [119283, 2013],
 [11932, 1998],
 [11933, 1991],
 [119450, 2014],
 [11951, 1971],
 [11962, 1996],
 [11967, 1988],
 [119675, 2013],
 [11968, 2005],
 [11969, 1993],
 [11970, 1997],
 [11973, 2000],
 [11974, 1989],
 [11975, 1997],
 [11976, 1985],
 [11977, 1980],
 [11978, 2000],
 [11979, 2002],
 [11980, 1995],
 [12, 2003],
 [120, 2001],
 [120467, 2014],
 [12088, 1992],
 [12090, 2003],
 [12092, 1951],
 [12094, 2006],
 [121, 2002],
 [12100, 2002],
 [12102, 1979],
 [12103, 2001],
 [12106, 1995],
 [12107, 2000],
 [12113, 2008],
 [12120, 1988],
 [12123, 1996],
 [1213, 1999],
 [12133, 2008],
 [12138, 2001],
 [12139, 1993],
 [12142, 2005],
 [12143, 1992],
 [12144, 1988],
 [12149, 2001],
 [12150, 1989],
 [12153, 2004],
 [12155, 2010],
 [12158, 1995],
 [12159, 1998],
 [12160, 1994],
 [12162, 2008],
 [12163, 2008],
 [12177, 2008],
 [12180, 2008],
 [12182, 2008],
 [121856, 2016],
 [12193, 2008],
 [122, 2003],
 [12201, 2010],
 [12208, 1967],
 [122081, 2013],
 [12211, 2000],
 [12212, 2000],
 [12220, 1999],
 [12222, 2008],
 [12227, 1991],
 [12228, 2005],
 [12230, 1961],
 [12233, 1988],
 [12238, 1997],
 [12241, 1996],
 [12244, 2009],
 [12246, 2007],
 [12253, 2003],
 [12257, 1998],
 [12262, 1977],
 [12268, 1976],
 [12277, 2002],
 [12279, 2003],
 [12281, 2004],
 [122857, 2012],
 [122917, 2014],
 [123, 1978],
 [12309, 1984],
 [123103, 2012],
 [123109, 2013],
 [12311, 1935],
 [12335, 1971],
 [123553, 2013],
 [12403, 2009],
 [12404, 2009],
 [12405, 2008],
 [12412, 2008],
 [12435, 2007],
 [12437, 2009],
 [12444, 2010],
 [12445, 2011],
 [124459, 2013],
 [1245, 1993],
 [1246, 2006],
 [1247, 2006],
 [124905, 2014],
 [12498, 1996],
 [1250, 2007],
 [12500, 1985],
 [12508, 2001],
 [12509, 2000],
 [1251, 2006],
 [12521, 1989],
 [12526, 2006],
 [12535, 1977],
 [12569, 2009],
 [12572, 2008],
 [12573, 2009],
 [12589, 2001],
 [12599, 1999],
 [12610, 2001],
 [12611, 1978],
 [12616, 1997],
 [12618, 1999],
 [1262, 2006],
 [12620, 2008],
 [12626, 1987],
 [12628, 1997],
 [12634, 2004],
 [12645, 2010],
 [1265, 2007],
 [126509, 2012],
 [12657, 2004],
 [1266, 2008],
 [12663, 1988],
 [1267, 2007],
 [1268, 2007],
 [126889, 2017],
 [12690, 2008],
 [12700, 2005],
 [12704, 1987],
 [12707, 1977],
 [1271, 2006],
 [1272, 2007],
 [1273, 2007],
 [127373, 2013],
 [127380, 2016],
 [127493, 2012],
 [127517, 2012],
 [127560, 2013],
 [127585, 2014],
 [12762, 1984],
 [12763, 2006],
 [12764, 1985],
 [12771, 2002],
 [12795, 2006],
 [1281, 1997],
 [12819, 2010],
 [128270, 2012],
 [12834, 2009],
 [12837, 2008],
 [12890, 2008],
 [129139, 2013],
 [12919, 1987],
 [129670, 2013],
 [13, 1994],
 [13001, 2008],
 [130150, 2013],
 [13018, 2008],
 [13025, 2007],
 [13027, 2008],
 [13051, 2008],
 [13053, 2008],
 [13056, 2008],
 [13059, 2007],
 [13064, 1993],
 [13067, 2007],
 [13072, 2007],
 [13075, 2006],
 [13090, 2008],
 [13150, 2008],
 [13153, 1992],
 [13154, 1991],
 [13155, 1985],
 [131631, 2014],
 [131634, 2015],
 [13177, 2007],
 [13183, 2009],
 [13184, 2008],
 [13197, 2006],
 [13207, 2009],
 [13223, 2008],
 [132344, 2013],
 [132363, 2013],
 [13243, 2007],
 [13249, 2006],
 [13256, 2008],
 [13275, 2006],
 [132759, 2012],
 [13279, 2008],
 [13282, 1975],
 [13291, 2008],
 [13335, 2008],
 [13341, 2005],
 [13342, 1982],
 [13346, 1986],
 [133463, 2012],
 [13359, 2008],
 [13369, 2002],
 [133694, 2012],
 [13370, 2003],
 [13374, 2005],
 [133805, 2013],
 [13389, 2008],
 [134, 2000],
 [13405, 2008],
 [13408, 2001],
 [13416, 2004],
 [13435, 2002],
 [134374, 2013],
 [134411, 2013],
 [13448, 2009],
 [13455, 2009],
 [13460, 2008],
 [13474, 2007],
 [13475, 2009],
 [13476, 2004],
 [13483, 2007],
 [13484, 2006],
 [13490, 2008],
 [13496, 2001],
 [13497, 2002],
 [13499, 2005],
 [13501, 2007],
 [13506, 2008],
 [13508, 2006],
 [13509, 1987],
 [13515, 2008],
 [13523, 2008],
 [13526, 2000],
 [13536, 2002],
 [13537, 2003],
 [135397, 2015],
 [13572, 2004],
 [1359, 2000],
 [13596, 2008],
 [13597, 1986],
 [1360, 2002],
 [13600, 2008],
 [136400, 2013],
 [136418, 2013],
 [1365, 2001],
 [1366, 1976],
 [13665, 1981],
 [13668, 2006],
 [1367, 1979],
 [136795, 2013],
 [136797, 2014],
 [136799, 2016],
 [1368, 1982],
 [13680, 2007],
 [136835, 2014],
 [13685, 1996],
 [1369, 1985],
 [137, 1993],
 [1370, 1988],
 [13700, 2004],
 [13702, 2004],
 [13703, 1987],
 [13704, 1988],
 [137093, 2013],
 [137094, 2014],
 [1371, 1982],
 [137106, 2014],
 [137113, 2014],
 [137116, 2017],
 [13715, 1986],
 [1372, 2006],
 [137321, 2014],
 [1374, 1985],
 [1375, 1990],
 [13751, 2006],
 [13763, 1984],
 [13764, 1985],
 [13766, 1986],
 [13767, 2006],
 [13768, 2002],
 [1378, 2006],
 [13788, 2009],
 [138, 1931],
 [13804, 2009],
 [13805, 2008],
 [1381, 2006],
 [138103, 2014],
 [13811, 2009],
 [13812, 2008],
 [13813, 2008],
 [13820, 1984],
 [138222, 2012],
 [13825, 2008],
 [13827, 2008],
 [13836, 2009],
 [13852, 1997],
 [13856, 2006],
 [138832, 2013],
 [138843, 2013],
 [13885, 2007],
 [13888, 1991],
 [1389, 1998],
 [13891, 1996],
 [139038, 2013],
 [13909, 1949],
 [1392, 2004],
 [13920, 2003],
 [13922, 2005],
 [13937, 1992],
 [13938, 1985],
 [13939, 1974],
 [13944, 2008],
 [13945, 1982],
 [13948, 2008],
 [13950, 2002],
 [139567, 2012],
 [13960, 2006],
 [13967, 2006],
 [13971, 2008],
 [13972, 2008],
 [13973, 2008],
 [13990, 2008],
 [13991, 2008],
 [139948, 2012],
 [13996, 2008],
 [14, 1999],
 [14001, 2007],
 [14011, 2008],
 [14012, 2006],
 [1402, 2006],
 [14024, 2004],
 [14030, 1969],
 [140300, 2016],
 [14047, 2007],
 [14055, 2006],
 [1406, 1991],
 [140607, 2015],
 [14064, 2006],
 [1408, 1995],
 [140823, 2013],
 [14097, 2005],
 [141, 2001],
 [1411, 1991],
 [14112, 2002],
 [14113, 2006],
 [14125, 2007],
 [14144, 2007],
 ...]

In [12]:
years_arr = np.array(years)
years_arr = years_arr.T

In [13]:
years_df = pd.DataFrame()
years_df["id"] = years_arr[0]
years_df["Year"] = years_arr[1]
years_df

          id  Year
0      10003  1997
1     100042  2014
2      10012  2005
3      10013  1986
4      10014  1985
...      ...   ...
4508    9986  2006
4509   99861  2015
4510    9988  2006
4511    9989  2001
4512    9994  1986

[4513 rows x 2 columns]

In [14]:
# We need inflation data or ticket data from 1915~current
# Everything will be converted into estimated number of tickets sold, then back to 2023 rates 

ticketprices = pd.read_csv("yearly_ticketprice.csv")
ticketprices
#ticketprices.dtypes

     Ticket Price  Year
0            0.07  1910
1            0.07  1911
2            0.07  1912
3            0.07  1913
4            0.07  1914
..            ...   ...
109          9.16  2019
110          9.41  2020
111         10.40  2021
112         10.45  2022
113         10.45  2023

[114 rows x 2 columns]

In [15]:
final_tx = years_df.join(ticketprices.set_index("Year"),on="Year")
final_tx

          id  Year  Ticket Price
0      10003  1997          4.59
1     100042  2014          8.17
2      10012  2005          6.41
3      10013  1986          3.71
4      10014  1985          3.55
...      ...   ...           ...
4508    9986  2006          6.55
4509   99861  2015          8.43
4510    9988  2006          6.55
4511    9989  2001          5.66
4512    9994  1986          3.71

[4513 rows x 3 columns]

In [16]:
#final_tx[(final_tx["Year"] == 2015)]
#final_tx.iloc[:,[1,2]]

In [17]:
final_tx["id"]

0        10003
1       100042
2        10012
3        10013
4        10014
         ...
4508      9986
4509     99861
4510      9988
4511      9989
4512      9994
Name: id, Length: 4513, dtype: int64

In [18]:
columns = movies.iloc[:,[0,14,15,3]]
columns["id"]

0        10003
1       100042
2        10012
3        10013
4        10014
         ...
4508      9986
4509     99861
4510      9988
4511      9989
4512      9994
Name: id, Length: 4513, dtype: int64

In [19]:
final = columns.merge(final_tx, how = "inner", on="id")
final

          id release_date     revenue     budget  Year  Ticket Price
0      10003   1997-04-03   118063304   68000000  1997          4.59
1     100042   2014-11-12   169837010   40000000  2014          8.17
2      10012   2005-02-25    19294901   35000000  2005          6.41
3      10013   1986-10-05    41382841   18000000  1986          3.71
4      10014   1985-10-31    29999213    3000000  1985          3.55
...      ...          ...         ...        ...   ...           ...
4508    9986   2006-12-15   144000000   85000000  2006          6.55
4509   99861   2015-04-22  1405403694  280000000  2015          8.43
4510    9988   2006-08-25    19179969   17500000  2006          6.55
4511    9989   2001-01-12    18195610   30000000  2001          5.66
4512    9994   1986-07-02    38625550   14000000  1986          3.71

[4513 rows x 6 columns]

In [20]:
#final = np.concatenate((columns,final_tx.iloc[:,[1,2]]),axis=1)

In [21]:
final["ROI"] = (final["revenue"]-final["budget"])/(final["budget"])

In [22]:
final["Tickets Sold"] = final["revenue"]/final["Ticket Price"]

In [23]:
#final = final.drop(["Estimated Tickets Sold"],axis=1)

In [24]:
#Checking with Titanic & Tangled

In [25]:
titanic = movies[(movies["id"]==597)]

In [26]:
final[(final["id"] == 597)]

,id,release_date,revenue,budget,Year,Ticket Price,ROI,Tickets Sold
3415,597,1997-11-18,1845034188,200000000,1997,4.59,8.225171,4.019682e+08

In [27]:
despic_me = movies[(movies["title"]=="Despicable Me")]

In [28]:
final[(final["id"]==20352)]

,id,release_date,revenue,budget,Year,Ticket Price,ROI,Tickets Sold
1646,20352,2010-07-08,543513985,69000000,2010,7.89,6.877014,6.888644e+07

In [29]:
sound_of_music = movies[(movies["title"]=="The Sound of Music")]
sound_of_music

,id,adult,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,...,spoken_languages,status,tagline,title,video,vote_average,vote_count,cast,crew,keywords
1122,15121,False,NaN,8200000,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",NaN,tt0059742,en,The Sound of Music,Film adaptation of a classic Rodgers and Hamme...,...,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,The happiest sound in all the world!,The Sound of Music,False,7.4,966,"[{'cast_id': 1, 'character': 'Maria', 'credit_...","[{'credit_id': '52fe463b9251416c75071a61', 'de...","[{'id': 836, 'name': 'resistance'}, {'id': 120..."

In [30]:
final[(final["id"]==15121)]

,id,release_date,revenue,budget,Year,Ticket Price,ROI,Tickets Sold
1122,15121,1965-03-02,286214286,8200000,1965,1.01,33.904181,2.833805e+08

In [31]:
shrek_2 = movies[(movies["title"]=="Shrek 2")]
shrek_2

,id,adult,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,...,spoken_languages,status,tagline,title,video,vote_average,vote_count,cast,crew,keywords
3848,809,False,"{'id': 2150, 'name': 'Shrek Collection', 'post...",150000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 16, '...",http://www.shrek2.com/,tt0298148,en,Shrek 2,"Shrek, Fiona and Donkey set off to Far, Far Aw...",...,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Once upon another time...,Shrek 2,False,6.7,3082,"[{'cast_id': 29, 'character': 'Shrek (voice)',...","[{'credit_id': '57d85f1ac3a36878e90025c4', 'de...","[{'id': 378, 'name': 'prison'}, {'id': 2343, '..."

In [32]:
final[(final["id"]==809)]

,id,release_date,revenue,budget,Year,Ticket Price,ROI,Tickets Sold
3848,809,2004-05-19,919838758,150000000,2004,6.21,5.132258,1.481222e+08

In [33]:
final["Revenue in 2023"] = final["Tickets Sold"]*10.45

In [34]:
final

,id,release_date,revenue,budget,Year,Ticket Price,ROI,Tickets Sold,Revenue in 2023
0,10003,1997-04-03,118063304,68000000,1997,4.59,0.736225,2.572185e+07,2.687934e+08
1,100042,2014-11-12,169837010,40000000,2014,8.17,3.245925,2.078788e+07,2.172334e+08
2,10012,2005-02-25,19294901,35000000,2005,6.41,-0.448717,3.010125e+06,3.145581e+07
3,10013,1986-10-05,41382841,18000000,1986,3.71,1.299047,1.115440e+07,1.165635e+08
4,10014,1985-10-31,29999213,3000000,1985,3.55,8.999738,8.450483e+06,8.830754e+07
...,...,...,...,...,...,...,...,...,...
4508,9986,2006-12-15,144000000,85000000,2006,6.55,0.694118,2.198473e+07,2.297405e+08
4509,99861,2015-04-22,1405403694,280000000,2015,8.43,4.019299,1.667146e+08,1.742167e+09
4510,9988,2006-08-25,19179969,17500000,2006,6.55,0.095998,2.928240e+06,3.060010e+07
4511,9989,2001-01-12,18195610,30000000,2001,5.66,-0.393480,3.214772e+06,3.359437e+07
4512,9994,1986-07-02,38625550,14000000,1986,3.71,1.758968,1.041120e+07,1.087970e+08

In [35]:
final

,id,release_date,revenue,budget,Year,Ticket Price,ROI,Tickets Sold,Revenue in 2023
0,10003,1997-04-03,118063304,68000000,1997,4.59,0.736225,2.572185e+07,2.687934e+08
1,100042,2014-11-12,169837010,40000000,2014,8.17,3.245925,2.078788e+07,2.172334e+08
2,10012,2005-02-25,19294901,35000000,2005,6.41,-0.448717,3.010125e+06,3.145581e+07
3,10013,1986-10-05,41382841,18000000,1986,3.71,1.299047,1.115440e+07,1.165635e+08
4,10014,1985-10-31,29999213,3000000,1985,3.55,8.999738,8.450483e+06,8.830754e+07
...,...,...,...,...,...,...,...,...,...
4508,9986,2006-12-15,144000000,85000000,2006,6.55,0.694118,2.198473e+07,2.297405e+08
4509,99861,2015-04-22,1405403694,280000000,2015,8.43,4.019299,1.667146e+08,1.742167e+09
4510,9988,2006-08-25,19179969,17500000,2006,6.55,0.095998,2.928240e+06,3.060010e+07
4511,9989,2001-01-12,18195610,30000000,2001,5.66,-0.393480,3.214772e+06,3.359437e+07
4512,9994,1986-07-02,38625550,14000000,1986,3.71,1.758968,1.041120e+07,1.087970e+08

In [36]:
final_1 = movies.merge(final, how = "outer", on="id")

In [37]:
months = []
for i in range(len(release_dates_filt)):
    entry_month = dates.iloc[i][1].month
    months.append([release_dates_filt.iloc[i][0],entry_month])

months_arr = np.array(months)
months_arr = months_arr.T

months_df = pd.DataFrame()
months_df["id"] = months_arr[0]
months_df["Month"] = months_arr[1]

In [38]:
months_df

          id  Month
0      10003      4
1     100042     11
2      10012      2
3      10013     10
4      10014     10
...      ...    ...
4508    9986     12
4509   99861      4
4510    9988      8
4511    9989      1
4512    9994      7

[4513 rows x 2 columns]

In [39]:
final_2 = final_1.merge(months_df, how = "inner", on="id")
final_2

,id,adult,belongs_to_collection,budget_x,genres,homepage,imdb_id,original_language,original_title,overview,...,keywords,release_date_y,revenue_y,budget_y,Year,Ticket Price,ROI,Tickets Sold,Revenue in 2023,Month
0,10003,False,"{'id': 86224, 'name': 'The Saint Collection', ...",68000000,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,tt0120053,en,The Saint,"Ivan Tretiak, Russian Mafia boss who wants to ...",...,"[{'id': 220, 'name': 'berlin'}, {'id': 2139, '...",1997-04-03,118063304,68000000,1997,4.59,0.736225,2.572185e+07,2.687934e+08,4
1,100042,False,"{'id': 96665, 'name': 'Dumb and Dumber Collect...",40000000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt2096672,en,Dumb and Dumber To,20 years after the dimwits set out on their fi...,...,"[{'id': 6054, 'name': 'friendship'}, {'id': 96...",2014-11-12,169837010,40000000,2014,8.17,3.245925,2.078788e+07,2.172334e+08,11
2,10012,False,NaN,35000000,"[{'id': 27, 'name': 'Horror'}, {'id': 35, 'nam...",NaN,tt0257516,en,Cursed,A werewolf loose in Los Angeles changes the li...,...,"[{'id': 1155, 'name': 'brother sister relation...",2005-02-25,19294901,35000000,2005,6.41,-0.448717,3.010125e+06,3.145581e+07,2
3,10013,False,NaN,18000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,tt0091738,en,Peggy Sue Got Married,Peggy Sue faints at a Highschool reunion. When...,...,"[{'id': 4379, 'name': 'time travel'}, {'id': 1...",1986-10-05,41382841,18000000,1986,3.71,1.299047,1.115440e+07,1.165635e+08,10
4,10014,False,"{'id': 8581, 'name': 'A Nightmare on Elm Stree...",3000000,"[{'id': 27, 'name': 'Horror'}]",NaN,tt0089686,en,A Nightmare on Elm Street Part 2: Freddy's Rev...,A new family moves into the house on Elm Stree...,...,"[{'id': 237, 'name': 'gay'}, {'id': 246, 'name...",1985-10-31,29999213,3000000,1985,3.55,8.999738,8.450483e+06,8.830754e+07,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4508,9986,False,NaN,85000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",NaN,tt0413895,en,Charlotte's Web,Wilbur the pig is scared of the end of the sea...,...,"[{'id': 1701, 'name': 'hero'}, {'id': 3875, 'n...",2006-12-15,144000000,85000000,2006,6.55,0.694118,2.198473e+07,2.297405e+08,12
4509,99861,False,"{'id': 86311, 'name': 'The Avengers Collection...",280000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://marvel.com/movies/movie/193/avengers_ag...,tt2395427,en,Avengers: Age of Ultron,When Tony Stark tries to jumpstart a dormant p...,...,"[{'id': 8828, 'name': 'marvel comic'}, {'id': ...",2015-04-22,1405403694,280000000,2015,8.43,4.019299,1.667146e+08,1.742167e+09,4
4510,9988,False,NaN,17500000,"[{'id': 35, 'name': 'Comedy'}]",NaN,tt0486551,en,Beerfest,During a trip to Germany to scatter their gran...,...,"[{'id': 74, 'name': 'germany'}, {'id': 271, 'n...",2006-08-25,19179969,17500000,2006,6.55,0.095998,2.928240e+06,3.060010e+07,8
4511,9989,False,NaN,30000000,"[{'id': 28, 'name': 'Action'}, {'id': 80, 'nam...",http://www.antitrustthemovie.com/,tt0218817,en,Antitrust,A computer programmer's dream job at a hot Por...,...,"[{'id': 1576, 'name': 'technology'}, {'id': 21...",2001-01-12,18195610,30000000,2001,5.66,-0.393480,3.214772e+06,3.359437e+07,1
4512,9994,False,NaN,14000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 16, 'nam...",http://movies.disney.com/the-great-mouse-detec...,tt0091149,en,The Great Mouse Detective,When the diabolical Professor Ratigan kidnaps ...,...,"[{'id': 212, 'name': 'london england'}, {'id':...",1986-07-02,38625550,14000000,1986,3.71,1.758968,1.041120e+07,1.087970e+08,7

In [40]:
final_2.to_csv('movies_inflation_2.csv',index=False)

In [41]:
movies_infl = pd.read_csv("movies_inflation_2.csv")
movies_infl.iloc[0]

id                                                                   10003
adult                                                                False
belongs_to_collection    {'id': 86224, 'name': 'The Saint Collection', ...
budget_x                                                          68000000
genres                   [{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...
homepage                                                               NaN
imdb_id                                                          tt0120053
original_language                                                       en
original_title                                                   The Saint
overview                 Ivan Tretiak, Russian Mafia boss who wants to ...
popularity                                                        10.97633
poster_path                               /uA24D8JCg21RDINMZ3vFaQYdIzW.jpg
production_companies     [{'name': 'Paramount Pictures', 'id': 4}, {'na...
production_countries     [{'iso_3166_1': 'US', 'name': 'United States o...
release_date_x                                                  1997-04-03
revenue_x                                                        118063304
runtime                                                              116.0
spoken_languages         [{'iso_639_1': 'en', 'name': 'English'}, {'iso...
status                                                            Released
tagline                  Never reveal your name. Never turn your back. ...
title                                                            The Saint
video                                                                False
vote_average                                                           5.9
vote_count                                                             310
cast                     [{'cast_id': 13, 'character': 'Simon Templar',...
crew                     [{'credit_id': '52fe43039251416c75000187', 'de...
keywords                 [{'id': 220, 'name': 'berlin'}, {'id': 2139, '...
release_date_y                                                  1997-04-03
revenue_y                                                        118063304
budget_y                                                          68000000
Year                                                                  1997
Ticket Price                                                          4.59
ROI                                                               0.736225
Tickets Sold                                               25721852.723312
Revenue in 2023                                           268793360.958606
Month                                                                    4
Name: 0, dtype: object